nrfconnect/sdk-nrf/drivers/wifi/nrf71/osal/fw_if/umac_if/src/system/fmac_api.c
/*
 * Copyright (c) 2024 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/**
 * @brief File containing API definitions for the
 * FMAC IF Layer of the Wi-Fi driver.
 */

#include <nrf71_wifi_ctrl.h>
#include <common/mem_mgmt.h>
#include "system/fmac_api.h"
#include "system/hal_api.h"
#include "system/fmac_structs.h"
#include "common/fmac_util.h"
#include "system/fmac_peer.h"
#include "system/fmac_vif.h"
#include "system/fmac_tx.h"
#include "system/fmac_rx.h"
#include "system/fmac_cmd.h"
#include "system/fmac_event.h"
#include "util.h"


static unsigned char nrf_wifi_fmac_vif_idx_get(struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx)
{
	unsigned char i = 0;
	struct nrf_wifi_sys_fmac_dev_ctx *sys_dev_ctx = NULL;

	sys_dev_ctx = wifi_dev_priv(fmac_dev_ctx);

	for (i = 0; i < MAX_NUM_VIFS; i++) {
		if (sys_dev_ctx->vif_ctx[i] == NULL) {
			break;
		}
	}

	return i;
}


#ifdef NRF71_DATA_TX
static enum nrf_wifi_status nrf_wifi_sys_fmac_init_tx(struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx)
{
	struct nrf_wifi_fmac_priv *fpriv = NULL;
	struct nrf_wifi_sys_fmac_priv *sys_fpriv = NULL;
	struct nrf_wifi_sys_fmac_dev_ctx *sys_dev_ctx = NULL;
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;

	fpriv = fmac_dev_ctx->fpriv;

	sys_fpriv = wifi_fmac_priv(fpriv);
	sys_dev_ctx = wifi_dev_priv(fmac_dev_ctx);

	status = tx_init(fmac_dev_ctx);

	return status;
}


static void nrf_wifi_sys_fmac_deinit_tx(struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx)
{
	struct nrf_wifi_fmac_priv *fpriv = NULL;
	struct nrf_wifi_sys_fmac_dev_ctx *sys_dev_ctx = NULL;

	sys_dev_ctx = wifi_dev_priv(fmac_dev_ctx);

	fpriv = fmac_dev_ctx->fpriv;

	tx_deinit(fmac_dev_ctx);
}

#endif /* NRF71_DATA_TX */

static enum nrf_wifi_status nrf_wifi_sys_fmac_init_rx(struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx)
{
	struct nrf_wifi_fmac_priv *fpriv = NULL;
	struct nrf_wifi_sys_fmac_priv *sys_fpriv = NULL;
	struct nrf_wifi_sys_fmac_dev_ctx *sys_dev_ctx = NULL;
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	unsigned int size = 0;
	unsigned int desc_id = 0;

	fpriv = fmac_dev_ctx->fpriv;
	sys_fpriv = wifi_fmac_priv(fpriv);
	sys_dev_ctx = wifi_dev_priv(fmac_dev_ctx);

	size = (sys_fpriv->num_rx_bufs * sizeof(struct nrf_wifi_fmac_buf_map_info));

	sys_dev_ctx->rx_buf_info = nrf_wifi_mem_zalloc(NRF_WIFI_MEM_POOL_TYPE_DATA, size);

	if (!sys_dev_ctx->rx_buf_info) {
		nrf_wifi_osal_log_err("%s: No space for RX buf info",
				      __func__);
		goto out;
	}

	for (desc_id = 0; desc_id < sys_fpriv->num_rx_bufs; desc_id++) {
		status = nrf_wifi_fmac_rx_cmd_send(fmac_dev_ctx,
						   NRF_WIFI_FMAC_RX_CMD_TYPE_INIT,
						   desc_id);

		if (status != NRF_WIFI_STATUS_SUCCESS) {
			nrf_wifi_osal_log_err("%s: RX init failed for desc_id = %d",
					      __func__,
					      desc_id);
			goto out;
		}
	}
#ifdef NRF71_RX_WQ_ENABLED
	sys_dev_ctx->rx_tasklet = nrf_wifi_osal_tasklet_alloc(NRF_WIFI_TASKLET_TYPE_RX);
	if (!sys_dev_ctx->rx_tasklet) {
		nrf_wifi_osal_log_err("%s: No space for RX tasklet",
				      __func__);
		status = NRF_WIFI_STATUS_FAIL;
		goto out;
	}

	sys_dev_ctx->rx_tasklet_event_q = nrf_wifi_utils_q_alloc();
	if (!sys_dev_ctx->rx_tasklet_event_q) {
		nrf_wifi_osal_log_err("%s: No space for RX tasklet event queue",
				      __func__);
		status = NRF_WIFI_STATUS_FAIL;
		goto out;
	}

	nrf_wifi_osal_tasklet_init(sys_dev_ctx->rx_tasklet,
				   nrf_wifi_fmac_rx_tasklet,
				   (unsigned long)fmac_dev_ctx);
#endif /* NRF71_RX_WQ_ENABLED */
out:
	return status;
}


static enum nrf_wifi_status nrf_wifi_sys_fmac_deinit_rx(struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx)
{
	struct nrf_wifi_fmac_priv *fpriv = NULL;
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_sys_fmac_dev_ctx *sys_dev_ctx = NULL;
	struct nrf_wifi_sys_fmac_priv *sys_fpriv = NULL;
	unsigned int desc_id = 0;

	fpriv = fmac_dev_ctx->fpriv;
	sys_fpriv = wifi_fmac_priv(fpriv);
	sys_dev_ctx = wifi_dev_priv(fmac_dev_ctx);

#ifdef NRF71_RX_WQ_ENABLED
	nrf_wifi_osal_tasklet_free(sys_dev_ctx->rx_tasklet);
	nrf_wifi_utils_q_free(sys_dev_ctx->rx_tasklet_event_q);
#endif /* NRF71_RX_WQ_ENABLED */

	for (desc_id = 0; desc_id < sys_fpriv->num_rx_bufs; desc_id++) {
		status = nrf_wifi_fmac_rx_cmd_send(fmac_dev_ctx,
						   NRF_WIFI_FMAC_RX_CMD_TYPE_DEINIT,
						   desc_id);

		if (status != NRF_WIFI_STATUS_SUCCESS) {
			nrf_wifi_osal_log_err("%s: RX deinit failed for desc_id = %d",
					      __func__,
					      desc_id);
			goto out;
		}
	}

	nrf_wifi_mem_free(NRF_WIFI_MEM_POOL_TYPE_DATA, sys_dev_ctx->rx_buf_info);

	sys_dev_ctx->rx_buf_info = NULL;
out:
	return status;
}

static enum nrf_wifi_status
nrf_wifi_sys_fmac_fw_init(struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx, unsigned int *rf_params_addr,
			  unsigned int vtf_buffer_start_address,
#ifdef NRF_WIFI_LOW_POWER
			  int sleep_type,
#endif /* NRF_WIFI_LOW_POWER */
			  unsigned int phy_calib, unsigned char op_band, bool beamforming,
			  struct nrf_wifi_tx_pwr_ctrl_params *tx_pwr_ctrl,
			  unsigned char *country_code)
{
	unsigned long start_time_us = 0;
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_sys_fmac_priv *sys_fpriv = NULL;
#ifdef NRF_WIFI_RX_BUFF_PROG_UMAC
	struct nrf_wifi_rx_buf *rx_buf_ipc = NULL, *rx_buf_info_iter = NULL;
	unsigned int desc_id = 0;
	unsigned int buf_addr = 0;
#endif /*NRF_WIFI_RX_BUFF_PROG_UMAC */

	sys_fpriv = wifi_fmac_priv(fmac_dev_ctx->fpriv);

#ifdef NRF71_DATA_TX
	status = nrf_wifi_sys_fmac_init_tx(fmac_dev_ctx);

	if (status != NRF_WIFI_STATUS_SUCCESS) {
		nrf_wifi_osal_log_err("%s: Init TX failed",
				      __func__);
		goto out;
	}
#endif /* NRF71_DATA_TX */

	status = nrf_wifi_sys_fmac_init_rx(fmac_dev_ctx);

	if (status != NRF_WIFI_STATUS_SUCCESS) {
		nrf_wifi_osal_log_err("%s: Init RX failed",
				      __func__);
#ifdef NRF71_DATA_TX
		nrf_wifi_sys_fmac_deinit_tx(fmac_dev_ctx);
#endif
		goto out;
	}

	status = umac_cmd_sys_init(
		fmac_dev_ctx, rf_params_addr, vtf_buffer_start_address, &sys_fpriv->data_config,
#ifdef NRF_WIFI_LOW_POWER
		sleep_type,
#endif /* NRF_WIFI_LOW_POWER */
		phy_calib, op_band, beamforming, tx_pwr_ctrl, country_code);

	if (status != NRF_WIFI_STATUS_SUCCESS) {
		nrf_wifi_osal_log_err("%s: UMAC init failed",
				      __func__);
		nrf_wifi_sys_fmac_deinit_rx(fmac_dev_ctx);
#ifdef NRF71_DATA_TX
		nrf_wifi_sys_fmac_deinit_tx(fmac_dev_ctx);
#endif /* NRF71_DATA_TX */
		goto out;
	}
	start_time_us = nrf_wifi_osal_time_get_curr_us();
	while (!fmac_dev_ctx->fw_init_done) {
		nrf_wifi_osal_sleep_ms(1);
#define MAX_INIT_WAIT (5 * 1000 * 1000)
		if (nrf_wifi_osal_time_elapsed_us(start_time_us) >= MAX_INIT_WAIT) {
			break;
		}
	}

