nrfconnect/sdk-nrf/drivers/wifi/nrf71/osal/fw_if/umac_if/src/system/fmac_api.c
	if (!fmac_dev_ctx->fw_init_done) {
		nrf_wifi_osal_log_err("%s: UMAC init timed out",
				      __func__);
		nrf_wifi_sys_fmac_deinit_rx(fmac_dev_ctx);
#ifdef NRF71_DATA_TX
		nrf_wifi_sys_fmac_deinit_tx(fmac_dev_ctx);
#endif /* NRF71_DATA_TX */
		status = NRF_WIFI_STATUS_FAIL;
		goto out;
	}

	status = umac_cmd_sys_lmac_tuning_params(fmac_dev_ctx);

	if (status != NRF_WIFI_STATUS_SUCCESS) {
		nrf_wifi_osal_log_err("%s: LMAC tuning params config failed",
				      __func__);
		nrf_wifi_sys_fmac_deinit_rx(fmac_dev_ctx);
#ifdef NRF71_DATA_TX
		nrf_wifi_sys_fmac_deinit_tx(fmac_dev_ctx);
#endif /* NRF71_DATA_TX */
		goto out;
	}

#ifdef NRF_WIFI_RX_BUFF_PROG_UMAC
	rx_buf_ipc = nrf_wifi_mem_zalloc(NRF_WIFI_MEM_POOL_TYPE_CTRL, sys_fpriv->num_rx_bufs *
					      sizeof(struct nrf_wifi_rx_buf));

	rx_buf_info_iter = rx_buf_ipc;

	for (desc_id = 0; desc_id < sys_fpriv->num_rx_bufs; desc_id++) {
		buf_addr = (unsigned int)nrf_wifi_fmac_get_rx_buf_map_addr(fmac_dev_ctx,
									  desc_id);
		if (buf_addr) {
			rx_buf_info_iter->skb_pointer = buf_addr;
			nrf_wifi_osal_log_dbg("%s: RX buf mapped desc_id=%d buf_addr=%p",
					      __func__, desc_id, (void *)buf_addr);
			rx_buf_info_iter->skb_desc_no = desc_id;
			rx_buf_info_iter++;
		} else {
			nrf_wifi_osal_log_err("%s: UMAC rx buff not mapped for desc_id=%d",
					      __func__, desc_id);
			status = NRF_WIFI_STATUS_FAIL;
			goto out;
		}
	}
	status = nrf_wifi_fmac_prog_rx_buf_info(fmac_dev_ctx,
						rx_buf_ipc,
						sys_fpriv->num_rx_bufs);
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		nrf_wifi_osal_log_err("%s: UMAC rx buff programming failed",
				      __func__);
		status = NRF_WIFI_STATUS_FAIL;
		goto out;
	} else {
		nrf_wifi_osal_log_dbg("%s: UMAC rx buff programmed num_buffs=%d",
				      __func__, sys_fpriv->num_rx_bufs);
		nrf_wifi_mem_free(NRF_WIFI_MEM_POOL_TYPE_CTRL, rx_buf_ipc);
	}
#endif /*NRF_WIFI_RX_BUFF_PROG_UMAC */
	status = NRF_WIFI_STATUS_SUCCESS;

out:
	return status;
}

static void nrf_wifi_sys_fmac_fw_deinit(struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx)
{
	/* TODO: To be activated once UMAC supports deinit */
#ifdef NOTYET
	unsigned long start_time_us = 0;
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;

	status = umac_cmd_deinit(fmac_dev_ctx);

	if (status != NRF_WIFI_STATUS_SUCCESS) {
		nrf_wifi_osal_log_err("%s: UMAC deinit failed",
				      __func__);
		goto out;
	}

	start_time_us = nrf_wifi_osal_time_get_curr_us();

	while (!fmac_dev_ctx->fw_deinit_done) {
#define MAX_DEINIT_WAIT (5 * 1000 * 1000)
		nrf_wifi_osal_sleep_ms(1);
		if (nrf_wifi_osal_time_elapsed_us(start_time_us) >= MAX_DEINIT_WAIT) {
			break;
		}
	}

	if (!fmac_dev_ctx->fw_deinit_done) {
		nrf_wifi_osal_log_err("%s: UMAC deinit timed out",
				      __func__);
		status = NRF_WIFI_STATUS_FAIL;
		goto out;
	}
out:
#endif /* NOTYET */
	nrf_wifi_sys_fmac_deinit_rx(fmac_dev_ctx);
#ifdef NRF71_DATA_TX
	nrf_wifi_sys_fmac_deinit_tx(fmac_dev_ctx);
#endif /* NRF71_DATA_TX */

}

struct nrf_wifi_fmac_dev_ctx *nrf_wifi_sys_fmac_dev_add(struct nrf_wifi_fmac_priv *fpriv,
							void *os_dev_ctx)
{
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;
	struct nrf_wifi_sys_fmac_dev_ctx *sys_fmac_dev_ctx = NULL;
#ifdef NRF71_DATA_TX
	struct nrf_wifi_sys_fmac_priv *sys_fpriv = NULL;
#endif /* NRF71_DATA_TX */

	if (!fpriv || !os_dev_ctx) {
		return NULL;
	}

	if (fpriv->op_mode != NRF_WIFI_OP_MODE_SYS) {
		nrf_wifi_osal_log_err("%s: Invalid op mode",
				      __func__);
		goto out;
	}

	fmac_dev_ctx = nrf_wifi_mem_zalloc(NRF_WIFI_MEM_POOL_TYPE_CTRL,
					   sizeof(*fmac_dev_ctx) + sizeof(*sys_fmac_dev_ctx));

	if (!fmac_dev_ctx) {
		nrf_wifi_osal_log_err("%s: Unable to allocate fmac_dev_ctx",
				      __func__);
		goto out;
	}

	fmac_dev_ctx->fpriv = fpriv;
	fmac_dev_ctx->os_dev_ctx = os_dev_ctx;

	fmac_dev_ctx->hal_dev_ctx = nrf_wifi_sys_hal_dev_add(fpriv->hpriv,
							     fmac_dev_ctx);

	if (!fmac_dev_ctx->hal_dev_ctx) {
		nrf_wifi_osal_log_err("%s: nrf_wifi_sys_hal_dev_add failed",
				      __func__);

		nrf_wifi_mem_free(NRF_WIFI_MEM_POOL_TYPE_CTRL, fmac_dev_ctx);
		fmac_dev_ctx = NULL;
		goto out;
	}
#ifdef NRF71_DATA_TX

	sys_fpriv = wifi_fmac_priv(fpriv);
	fpriv->hpriv->cfg_params.max_ampdu_len_per_token = sys_fpriv->max_ampdu_len_per_token;
#endif /* NRF71_DATA_TX */

	fmac_dev_ctx->op_mode = NRF_WIFI_OP_MODE_SYS;
out:
	return fmac_dev_ctx;
}

enum nrf_wifi_status
nrf_wifi_sys_fmac_dev_init(struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx,
#ifdef NRF_WIFI_LOW_POWER
			   int sleep_type,
#endif /* NRF_WIFI_LOW_POWER */
			   unsigned int phy_calib, unsigned char op_band, bool beamforming,
			   struct nrf_wifi_tx_pwr_ctrl_params *tx_pwr_ctrl_params,
			   struct nrf_wifi_tx_pwr_ceil_params *tx_pwr_ceil_params,
			   unsigned char *country_code,
			   unsigned int *rf_params_addr, unsigned int vtf_buffer_start_address)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;

	if (!fmac_dev_ctx) {
		nrf_wifi_osal_log_err("%s: Invalid device context",
				      __func__);
		goto out;
	}

	if (fmac_dev_ctx->op_mode != NRF_WIFI_OP_MODE_SYS) {
		nrf_wifi_osal_log_err("%s: Invalid op mode",
				      __func__);
		goto out;
	}

	status = nrf_wifi_hal_dev_init(fmac_dev_ctx->hal_dev_ctx);

	if (status != NRF_WIFI_STATUS_SUCCESS) {
		nrf_wifi_osal_log_err("%s: nrf_wifi_hal_dev_init failed",
				      __func__);
		goto out;
	}

	status = nrf_wifi_sys_fmac_fw_init(fmac_dev_ctx, rf_params_addr, vtf_buffer_start_address,
#ifdef NRF_WIFI_LOW_POWER
					   sleep_type,
#endif /* NRF_WIFI_LOW_POWER */
					   phy_calib, op_band, beamforming, tx_pwr_ctrl_params,
					   country_code);

	if (status == NRF_WIFI_STATUS_FAIL) {
		nrf_wifi_osal_log_err("%s: nrf_wifi_sys_fmac_fw_init failed",
				      __func__);
		goto out;
	}
out:
	return status;
}

void nrf_wifi_sys_fmac_dev_deinit(struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx)
{
	if (fmac_dev_ctx->op_mode != NRF_WIFI_OP_MODE_SYS) {
		nrf_wifi_osal_log_err("%s: Invalid op mode",
				      __func__);
		return;
	}

	/* Tell the firmware to stand down first: the de-init command travels over
	 * the same transport that the HAL de-init tears down.
	 */
	nrf_wifi_sys_fmac_fw_deinit(fmac_dev_ctx);
	nrf_wifi_hal_dev_deinit(fmac_dev_ctx->hal_dev_ctx);
	nrf_wifi_mem_free(NRF_WIFI_MEM_POOL_TYPE_CTRL, fmac_dev_ctx->tx_pwr_ceil_params);
}

