nrfconnect/sdk-nrf/drivers/wifi/nrf71/osal/fw_if/umac_if/src/system/fmac_api.c
#ifdef NRF_WIFI_RPU_RECOVERY
enum nrf_wifi_status nrf_wifi_sys_fmac_rpu_recovery_callback(void *mac_dev_ctx,
							     void *event_data,
							     unsigned int len)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;
	struct nrf_wifi_sys_fmac_dev_ctx *sys_dev_ctx = NULL;
	struct nrf_wifi_fmac_priv *fpriv = NULL;
	struct nrf_wifi_sys_fmac_priv *sys_fpriv = NULL;

	fmac_dev_ctx = mac_dev_ctx;
	if (!fmac_dev_ctx) {
		goto out;
	}

	if (fmac_dev_ctx->op_mode != NRF_WIFI_OP_MODE_SYS) {
		nrf_wifi_osal_log_err("%s: Invalid op mode",
				      __func__);
		goto out;
	}

	fpriv = fmac_dev_ctx->fpriv;
	sys_fpriv = wifi_fmac_priv(fpriv);

	sys_dev_ctx = wifi_dev_priv(fmac_dev_ctx);
	if (!sys_dev_ctx) {
		nrf_wifi_osal_log_err("%s: Invalid device context",
				      __func__);
		goto out;
	}

	if (!sys_fpriv->callbk_fns.rpu_recovery_callbk_fn) {
		nrf_wifi_osal_log_err("%s: No RPU recovery callback function",
				      __func__);
		goto out;
	}

	/* Here we only care about FMAC, so, just use VIF0 */
	sys_fpriv->callbk_fns.rpu_recovery_callbk_fn(sys_dev_ctx->vif_ctx[0],
			event_data, len);

	status = NRF_WIFI_STATUS_SUCCESS;
out:
	return status;
}
#endif /* NRF_WIFI_RPU_RECOVERY */

struct nrf_wifi_fmac_priv *nrf_wifi_sys_fmac_init(struct nrf_wifi_data_config_params *data_config,
						  struct rx_buf_pool_params *rx_buf_pools,
						  struct nrf_wifi_fmac_callbk_fns *callbk_fns)
{
	struct nrf_wifi_fmac_priv *fpriv = NULL;
	struct nrf_wifi_sys_fmac_priv *sys_fpriv = NULL;
	struct nrf_wifi_hal_cfg_params hal_cfg_params;
	unsigned int pool_idx = 0;
	unsigned int desc = 0;

	fpriv = nrf_wifi_mem_zalloc(NRF_WIFI_MEM_POOL_TYPE_CTRL,
				    sizeof(*fpriv) + sizeof(*sys_fpriv));

	if (!fpriv) {
		nrf_wifi_osal_log_err("%s: Unable to allocate fpriv",
				      __func__);
		goto out;
	}

	sys_fpriv = wifi_fmac_priv(fpriv);

	nrf_wifi_mem_set(&hal_cfg_params,
			      0,
			      sizeof(hal_cfg_params));

	nrf_wifi_mem_cpy(&sys_fpriv->callbk_fns,
			      callbk_fns,
			      sizeof(sys_fpriv->callbk_fns));

	nrf_wifi_mem_cpy(&sys_fpriv->data_config,
			      data_config,
			      sizeof(sys_fpriv->data_config));

#ifdef NRF71_DATA_TX
	sys_fpriv->num_tx_tokens = NRF71_MAX_TX_TOKENS;
	sys_fpriv->num_tx_tokens_per_ac = (sys_fpriv->num_tx_tokens / NRF_WIFI_FMAC_AC_MAX);
	sys_fpriv->num_tx_tokens_spare = (sys_fpriv->num_tx_tokens % NRF_WIFI_FMAC_AC_MAX);
#endif /* NRF71_DATA_TX */
	nrf_wifi_mem_cpy(sys_fpriv->rx_buf_pools,
			      rx_buf_pools,
			      sizeof(sys_fpriv->rx_buf_pools));

	for (pool_idx = 0; pool_idx < MAX_NUM_OF_RX_QUEUES; pool_idx++) {
		sys_fpriv->rx_desc[pool_idx] = desc;

		desc += sys_fpriv->rx_buf_pools[pool_idx].num_bufs;
	}

	sys_fpriv->num_rx_bufs = desc;

	hal_cfg_params.rx_buf_headroom_sz = RX_BUF_HEADROOM;
	hal_cfg_params.tx_buf_headroom_sz = TX_BUF_HEADROOM;
#ifdef NRF71_DATA_TX
	hal_cfg_params.max_tx_frms = (sys_fpriv->num_tx_tokens *
				      sys_fpriv->data_config.max_tx_aggregation);
#endif /* NRF71_DATA_TX */

	for (pool_idx = 0; pool_idx < MAX_NUM_OF_RX_QUEUES; pool_idx++) {
		hal_cfg_params.rx_buf_pool[pool_idx].num_bufs =
			sys_fpriv->rx_buf_pools[pool_idx].num_bufs;
		hal_cfg_params.rx_buf_pool[pool_idx].buf_sz =
			sys_fpriv->rx_buf_pools[pool_idx].buf_sz + RX_BUF_HEADROOM;
	}


	fpriv->hpriv = nrf_wifi_hal_init(&hal_cfg_params,
					 &nrf_wifi_sys_fmac_event_callback,
#ifdef NRF_WIFI_RPU_RECOVERY
					 &nrf_wifi_sys_fmac_rpu_recovery_callback);
#else
					 NULL);
#endif

	if (!fpriv->hpriv) {
		nrf_wifi_osal_log_err("%s: Unable to do HAL init",
				      __func__);
		nrf_wifi_mem_free(NRF_WIFI_MEM_POOL_TYPE_CTRL, fpriv);
		fpriv = NULL;
		sys_fpriv = NULL;
		goto out;
	}

	fpriv->op_mode = NRF_WIFI_OP_MODE_SYS;
out:
	return fpriv;
}


enum nrf_wifi_status nrf_wifi_sys_fmac_scan(void *dev_ctx,
					    unsigned char if_idx,
					    struct nrf_wifi_umac_scan_info *scan_info)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_umac_cmd_scan *scan_cmd = NULL;
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;
	struct nrf_wifi_sys_fmac_dev_ctx *sys_dev_ctx = NULL;
	int channel_info_len = (sizeof(scan_info->scan_params.center_frequency[0]) *
	scan_info->scan_params.num_scan_channels);

	fmac_dev_ctx = dev_ctx;

	if (fmac_dev_ctx->op_mode != NRF_WIFI_OP_MODE_SYS) {
		nrf_wifi_osal_log_err("%s: Invalid op mode",
				      __func__);
		goto out;
	}

	sys_dev_ctx = wifi_dev_priv(fmac_dev_ctx);
	if (!sys_dev_ctx) {
		nrf_wifi_osal_log_err("%s: Invalid device context",
				      __func__);
		goto out;
	}

	scan_cmd = nrf_wifi_mem_zalloc(NRF_WIFI_MEM_POOL_TYPE_CTRL,
				       (sizeof(*scan_cmd) + channel_info_len));

	if (!scan_cmd) {
		nrf_wifi_osal_log_err("%s: Unable to allocate memory",
				      __func__);
		goto out;
	}

	/* The firmware fills the scan results database into this buffer, both
	 * for display scan and (when the host asks for it) connect scan. Any
	 * scan that provides a non-zero database length gets a buffer.
	 */
	if (scan_info->scan_db_len) {
		nrf_wifi_osal_log_dbg("%s: scan_db_len = %d",
				      __func__,
				      scan_info->scan_db_len);
		scan_info->scan_db_addr =
			(unsigned int)nrf_wifi_mem_zalloc(NRF_WIFI_MEM_POOL_TYPE_CTRL,
							  scan_info->scan_db_len);
		if (!scan_info->scan_db_addr) {
			nrf_wifi_osal_log_err("%s: Unable to allocate memory",
					      __func__);
			goto out;
		}
	}

	scan_cmd->umac_hdr.cmd_evnt = NRF_WIFI_UMAC_CMD_TRIGGER_SCAN;
	scan_cmd->umac_hdr.ids.wdev_id = if_idx;
	scan_cmd->umac_hdr.ids.valid_fields |= NRF_WIFI_INDEX_IDS_WDEV_ID_VALID;

	nrf_wifi_mem_cpy(&scan_cmd->info,
			      scan_info,
			      (sizeof(scan_cmd->info) + channel_info_len));

	status = umac_cmd_cfg(fmac_dev_ctx,
			      scan_cmd,
			      sizeof(*scan_cmd) + channel_info_len);
out:
	if (scan_cmd) {
		nrf_wifi_mem_free(NRF_WIFI_MEM_POOL_TYPE_CTRL, scan_cmd);
	}

	/* Free the database buffer if the scan did not start. */
	if ((status != NRF_WIFI_STATUS_SUCCESS) && scan_info->scan_db_addr) {
		nrf_wifi_mem_free(NRF_WIFI_MEM_POOL_TYPE_CTRL,
				  (void *)(unsigned long)scan_info->scan_db_addr);
		scan_info->scan_db_addr = 0;
	}

