nrfconnect/sdk-nrf/drivers/wifi/nrf71/osal/fw_if/umac_if/src/system/fmac_api.c
	fmac_dev_ctx = dev_ctx;

	if (fmac_dev_ctx->op_mode != NRF_WIFI_OP_MODE_SYS) {
		nrf_wifi_osal_log_err("%s: Invalid op mode",
				      __func__);
		goto out;
	}

	sys_dev_ctx = wifi_dev_priv(fmac_dev_ctx);

	vif_ctx = sys_dev_ctx->vif_ctx[if_idx];

	nrf_wifi_mem_cpy(vif_ctx->bssid,
			      assoc_info->nrf_wifi_bssid,
			      NRF_WIFI_ETH_ADDR_LEN);

	assoc_cmd = nrf_wifi_mem_zalloc(NRF_WIFI_MEM_POOL_TYPE_CTRL, sizeof(*assoc_cmd));

	if (!assoc_cmd) {
		nrf_wifi_osal_log_err("%s: Unable to allocate memory",
				      __func__);
		goto out;
	}

	assoc_cmd->umac_hdr.cmd_evnt = NRF_WIFI_UMAC_CMD_ASSOCIATE;
	assoc_cmd->umac_hdr.ids.wdev_id = if_idx;
	assoc_cmd->umac_hdr.ids.valid_fields |= NRF_WIFI_INDEX_IDS_WDEV_ID_VALID;

	connect_common_info = &assoc_cmd->connect_common_info;

	nrf_wifi_mem_cpy(connect_common_info->mac_addr,
			      assoc_info->nrf_wifi_bssid,
			      NRF_WIFI_ETH_ADDR_LEN);

	if (!nrf_wifi_util_is_arr_zero(connect_common_info->mac_addr,
				       sizeof(connect_common_info->mac_addr))) {
		connect_common_info->valid_fields |=
			NRF_WIFI_CONNECT_COMMON_INFO_MAC_ADDR_VALID;
	}

	if (assoc_info->ssid.nrf_wifi_ssid_len > 0) {
		nrf_wifi_mem_cpy(&connect_common_info->ssid,
				      &assoc_info->ssid,
				      sizeof(connect_common_info->ssid));

		connect_common_info->valid_fields |=
			NRF_WIFI_CONNECT_COMMON_INFO_SSID_VALID;
	}

	connect_common_info->frequency = assoc_info->center_frequency;
	connect_common_info->valid_fields |= NRF_WIFI_CONNECT_COMMON_INFO_FREQ_VALID;

	if (assoc_info->wpa_ie.ie_len > 0) {
		nrf_wifi_mem_cpy(&connect_common_info->wpa_ie,
				      &assoc_info->wpa_ie,
				      sizeof(connect_common_info->wpa_ie));

		connect_common_info->valid_fields |=
			NRF_WIFI_CONNECT_COMMON_INFO_WPA_IE_VALID;
	}

	connect_common_info->use_mfp = assoc_info->use_mfp;
	connect_common_info->valid_fields |=
		NRF_WIFI_CONNECT_COMMON_INFO_USE_MFP_VALID;

	connect_common_info->nrf_wifi_flags |=
		NRF_WIFI_CMD_CONNECT_COMMON_INFO_USE_RRM;

	connect_common_info->control_port =
		assoc_info->control_port;

	if (assoc_info->prev_bssid_flag) {
		nrf_wifi_mem_cpy(connect_common_info->prev_bssid,
				      assoc_info->prev_bssid,
				      NRF_WIFI_ETH_ADDR_LEN);
		connect_common_info->nrf_wifi_flags |= NRF_WIFI_CONNECT_COMMON_INFO_PREV_BSSID;
	}

	if (assoc_info->bss_max_idle_time) {
		connect_common_info->maxidle_insec = assoc_info->bss_max_idle_time;
	}

	if (assoc_info->conn_type == NRF_WIFI_CONN_TYPE_SECURE) {
		connect_common_info->nrf_wifi_flags |=
			NRF_WIFI_CONNECT_COMMON_INFO_SECURITY;
	}

	status = umac_cmd_cfg(fmac_dev_ctx,
			      assoc_cmd,
			      sizeof(*assoc_cmd));
out:
	if (assoc_cmd) {
		nrf_wifi_mem_free(NRF_WIFI_MEM_POOL_TYPE_CTRL, assoc_cmd);
	}

	return status;
}


enum nrf_wifi_status nrf_wifi_sys_fmac_disassoc(void *dev_ctx,
						unsigned char if_idx,
						struct nrf_wifi_umac_disconn_info *disassoc_info)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_umac_cmd_disconn *disassoc_cmd = NULL;
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;

	fmac_dev_ctx = dev_ctx;

	if (fmac_dev_ctx->op_mode != NRF_WIFI_OP_MODE_SYS) {
		nrf_wifi_osal_log_err("%s: Invalid op mode",
				      __func__);
		goto out;
	}

	disassoc_cmd = nrf_wifi_mem_zalloc(NRF_WIFI_MEM_POOL_TYPE_CTRL, sizeof(*disassoc_cmd));

	if (!disassoc_cmd) {
		nrf_wifi_osal_log_err("%s: Unable to allocate memory",
				      __func__);
		goto out;
	}

	disassoc_cmd->umac_hdr.cmd_evnt = NRF_WIFI_UMAC_CMD_DEAUTHENTICATE;
	disassoc_cmd->umac_hdr.ids.wdev_id = if_idx;
	disassoc_cmd->umac_hdr.ids.valid_fields |= NRF_WIFI_INDEX_IDS_WDEV_ID_VALID;

	nrf_wifi_mem_cpy(&disassoc_cmd->info,
			      disassoc_info,
			      sizeof(disassoc_cmd->info));

	if (!nrf_wifi_util_is_arr_zero(disassoc_info->mac_addr,
				       sizeof(disassoc_info->mac_addr))) {
		disassoc_cmd->valid_fields |= NRF_WIFI_CMD_MLME_MAC_ADDR_VALID;
	}

	status = umac_cmd_cfg(fmac_dev_ctx,
			      disassoc_cmd,
			      sizeof(*disassoc_cmd));

out:
	if (disassoc_cmd) {
		nrf_wifi_mem_free(NRF_WIFI_MEM_POOL_TYPE_CTRL, disassoc_cmd);
	}

	return status;
}


enum nrf_wifi_status nrf_wifi_sys_fmac_add_key(void *dev_ctx,
					       unsigned char if_idx,
					       struct nrf_wifi_umac_key_info *key_info,
					       const char *mac_addr)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_umac_cmd_key *key_cmd = NULL;
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;
	struct nrf_wifi_sys_fmac_dev_ctx *sys_dev_ctx = NULL;
	struct nrf_wifi_fmac_vif_ctx *vif_ctx = NULL;
	int peer_id = -1;

	fmac_dev_ctx = dev_ctx;

	if (fmac_dev_ctx->op_mode != NRF_WIFI_OP_MODE_SYS) {
		nrf_wifi_osal_log_err("%s: Invalid op mode",
				      __func__);
		goto out;
	}

	sys_dev_ctx = wifi_dev_priv(fmac_dev_ctx);
	vif_ctx = sys_dev_ctx->vif_ctx[if_idx];

	key_cmd = nrf_wifi_mem_zalloc(NRF_WIFI_MEM_POOL_TYPE_CTRL, sizeof(*key_cmd));

	if (!key_cmd) {
		nrf_wifi_osal_log_err("%s: Unable to allocate memory", __func__);
		goto out;
	}

	key_cmd->umac_hdr.cmd_evnt = NRF_WIFI_UMAC_CMD_NEW_KEY;
	key_cmd->umac_hdr.ids.wdev_id = if_idx;
	key_cmd->umac_hdr.ids.valid_fields |= NRF_WIFI_INDEX_IDS_WDEV_ID_VALID;

	nrf_wifi_mem_cpy(&key_cmd->key_info,
			      key_info,
			      sizeof(key_cmd->key_info));

	if (mac_addr) {
		nrf_wifi_mem_cpy(key_cmd->mac_addr,
				      mac_addr,
				      NRF_WIFI_ETH_ADDR_LEN);

		key_cmd->valid_fields |= NRF_WIFI_CMD_KEY_MAC_ADDR_VALID;
	}

	if (key_info->key_type == NRF_WIFI_KEYTYPE_GROUP) {
		vif_ctx->groupwise_cipher = key_info->cipher_suite;
	} else if (key_info->key_type == NRF_WIFI_KEYTYPE_PAIRWISE) {
		peer_id = nrf_wifi_fmac_peer_get_id(fmac_dev_ctx,
						    mac_addr);

		if (peer_id == -1) {
			nrf_wifi_osal_log_err("%s: Invalid peer",
					      __func__);
			goto out;
		}

		sys_dev_ctx->tx_config.peers[peer_id].pairwise_cipher = key_info->cipher_suite;
	} else {
		nrf_wifi_osal_log_err("%s: Invalid key type %d",
				      __func__,
				      key_info->key_type);
		goto out;
	}

	if (key_info->key.nrf_wifi_key_len > 0) {
		key_cmd->key_info.valid_fields |= NRF_WIFI_KEY_VALID;
		key_cmd->key_info.valid_fields |= NRF_WIFI_KEY_IDX_VALID;
	}

	if (key_info->seq.nrf_wifi_seq_len > 0) {
		key_cmd->key_info.valid_fields |= NRF_WIFI_SEQ_VALID;
	}

