nrfconnect/sdk-nrf/drivers/wifi/nrf71/osal/fw_if/umac_if/src/system/fmac_api.c
	vif_idx = nrf_wifi_fmac_vif_idx_get(fmac_dev_ctx);
	sys_dev_ctx = wifi_dev_priv(fmac_dev_ctx);

	if (vif_idx == MAX_NUM_VIFS) {
		return NRF_WIFI_STATUS_FAIL;
	}

	nrf_wifi_mem_cpy(addr,
			      sys_dev_ctx->vif_ctx[vif_idx]->mac_addr,
			      NRF_WIFI_ETH_ADDR_LEN);

	if (((unsigned short)addr[5] + vif_idx) > 0xff) {
		nrf_wifi_osal_log_err("%s: MAC Address rollover!!",
				      __func__);
	}

	addr[5] += vif_idx;

	return NRF_WIFI_STATUS_SUCCESS;
}


unsigned char nrf_wifi_sys_fmac_add_vif(void *dev_ctx,
					void *os_vif_ctx,
					struct nrf_wifi_umac_add_vif_info *vif_info)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_umac_cmd_add_vif *add_vif_cmd = NULL;
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;
	struct nrf_wifi_fmac_vif_ctx *vif_ctx = NULL;
	unsigned char vif_idx = 0;
	struct nrf_wifi_sys_fmac_dev_ctx *sys_dev_ctx = NULL;

	fmac_dev_ctx = dev_ctx;

	if (fmac_dev_ctx->op_mode != NRF_WIFI_OP_MODE_SYS) {
		nrf_wifi_osal_log_err("%s: Invalid op mode",
				      __func__);
		goto out;
	}

	sys_dev_ctx = wifi_dev_priv(fmac_dev_ctx);

	switch (vif_info->iftype) {
	case NRF_WIFI_IFTYPE_STATION:
	case NRF_WIFI_IFTYPE_P2P_CLIENT:
#ifdef NRF71_SYSTEM_WITH_RAW_MODES
	case NRF_WIFI_STA_TX_INJECTOR:
	case NRF_WIFI_STA_PROMISC:
	case NRF_WIFI_STA_PROMISC_TX_INJECTOR:
#endif /* NRF71_SYSTEM_WITH_RAW_MODES */
	case NRF_WIFI_IFTYPE_AP:
	case NRF_WIFI_IFTYPE_P2P_GO:
		break;
	default:
		nrf_wifi_osal_log_err("%s: VIF type %d not supported",
				      __func__, vif_info->iftype);
		goto err;
	}

	if (nrf_wifi_fmac_vif_check_if_limit(fmac_dev_ctx,
					     vif_info->iftype)) {
		goto err;
	}

	vif_ctx = nrf_wifi_mem_zalloc(NRF_WIFI_MEM_POOL_TYPE_CTRL, sizeof(*vif_ctx));

	if (!vif_ctx) {
		nrf_wifi_osal_log_err("%s: Unable to allocate memory for VIF ctx",
				      __func__);
		goto err;
	}

	vif_ctx->fmac_dev_ctx = fmac_dev_ctx;
	vif_ctx->os_vif_ctx = os_vif_ctx;
	vif_ctx->if_type = vif_info->iftype;
	vif_ctx->mode = NRF_WIFI_STA_MODE;

	/**
	 * Set initial packet filter setting to filter all.
	 * subsequent calls to set packet filter will set
	 * packet_filter settings to appropriate value as
	 * desired by application.
	 */
#if defined(NRF71_RAW_DATA_RX) || defined(NRF71_PROMISC_DATA_RX)
	vif_ctx->packet_filter = 1;
#endif

	nrf_wifi_mem_cpy(vif_ctx->mac_addr,
			      vif_info->mac_addr,
			      sizeof(vif_ctx->mac_addr));

	vif_idx = nrf_wifi_fmac_vif_idx_get(fmac_dev_ctx);

	if (vif_idx == MAX_NUM_VIFS) {
		nrf_wifi_osal_log_err("%s: Unable to add additional VIF",
				      __func__);
		goto err;
	}

	/* We don't need to send a command to the RPU for the default interface,
	 * since the FW is adding that interface by default. We just need to
	 * send commands for non-default interfaces
	 */
	if (vif_idx != 0) {
		add_vif_cmd = nrf_wifi_mem_zalloc(NRF_WIFI_MEM_POOL_TYPE_CTRL,
						  sizeof(*add_vif_cmd));

		if (!add_vif_cmd) {
			nrf_wifi_osal_log_err("%s: Unable to allocate memory for cmd",
					      __func__);
			goto err;
		}

		add_vif_cmd->umac_hdr.cmd_evnt = NRF_WIFI_UMAC_CMD_NEW_INTERFACE;
		add_vif_cmd->umac_hdr.ids.wdev_id = vif_idx;
		add_vif_cmd->umac_hdr.ids.valid_fields |= NRF_WIFI_INDEX_IDS_WDEV_ID_VALID;

		nrf_wifi_mem_cpy(&add_vif_cmd->info,
				      vif_info,
				      sizeof(add_vif_cmd->info));

		add_vif_cmd->valid_fields |= NRF_WIFI_CMD_NEW_INTERFACE_IFTYPE_VALID;
		add_vif_cmd->valid_fields |= NRF_WIFI_CMD_NEW_INTERFACE_IFNAME_VALID;
		add_vif_cmd->valid_fields |= NRF_WIFI_CMD_NEW_INTERFACE_MAC_ADDR_VALID;

		status = umac_cmd_cfg(fmac_dev_ctx,
				      add_vif_cmd,
				      sizeof(*add_vif_cmd));

		if (status == NRF_WIFI_STATUS_FAIL) {
			nrf_wifi_osal_log_err("%s: NRF_WIFI_UMAC_CMD_NEW_INTERFACE failed",
					      __func__);
			goto err;
		}

	}

	sys_dev_ctx->vif_ctx[vif_idx] = vif_ctx;

	nrf_wifi_fmac_vif_incr_if_type(fmac_dev_ctx,
				       vif_ctx->if_type);

	goto out;
err:
	if (vif_ctx) {
		nrf_wifi_mem_free(NRF_WIFI_MEM_POOL_TYPE_CTRL, vif_ctx);
	}

	vif_idx = MAX_NUM_VIFS;

out:
	if (add_vif_cmd) {
		nrf_wifi_mem_free(NRF_WIFI_MEM_POOL_TYPE_CTRL, add_vif_cmd);
	}

	return vif_idx;
}


enum nrf_wifi_status nrf_wifi_sys_fmac_del_vif(void *dev_ctx,
					       unsigned char if_idx)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	enum nrf_wifi_status reset_status = NRF_WIFI_STATUS_SUCCESS;
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;
	struct nrf_wifi_fmac_vif_ctx *vif_ctx = NULL;
	struct nrf_wifi_umac_cmd_del_vif *del_vif_cmd = NULL;
	struct nrf_wifi_sys_fmac_dev_ctx *sys_dev_ctx = NULL;

	fmac_dev_ctx = dev_ctx;

	if (fmac_dev_ctx->op_mode != NRF_WIFI_OP_MODE_SYS) {
		nrf_wifi_osal_log_err("%s: Invalid op mode",
				      __func__);
		goto out;
	}

	if (if_idx >= MAX_NUM_VIFS) {
		nrf_wifi_osal_log_err("%s: Invalid VIF index %d",
				      __func__, if_idx);
		goto out;
	}

	sys_dev_ctx = wifi_dev_priv(fmac_dev_ctx);

	vif_ctx = sys_dev_ctx->vif_ctx[if_idx];

	if (!vif_ctx) {
		nrf_wifi_osal_log_err("%s: VIF ctx does not exist",
				      __func__);
		goto out;
	}

	switch (vif_ctx->if_type) {
	case NRF_WIFI_IFTYPE_STATION:
	case NRF_WIFI_IFTYPE_P2P_CLIENT:
#ifdef NRF71_SYSTEM_WITH_RAW_MODES
	case NRF_WIFI_STA_TX_INJECTOR:
	case NRF_WIFI_STA_PROMISC:
	case NRF_WIFI_STA_PROMISC_TX_INJECTOR:
#endif /* NRF71_SYSTEM_WITH_RAW_MODES */
	case NRF_WIFI_IFTYPE_AP:
	case NRF_WIFI_IFTYPE_P2P_GO:
		break;
	default:
		nrf_wifi_osal_log_err("%s: VIF type %d not supported",
				      __func__, vif_ctx->if_type);
		goto out;
	}

	/* Firmware creates VIF 0 internally and does not accept
	 * NEW_INTERFACE / DEL_INTERFACE for it, so any mode change
	 * (AP, P2P, raw overlay) persists across a down/up cycle
	 * unless we explicitly reset it here. Non-default VIFs are
	 * fully destroyed by the DEL_INTERFACE command sent below.
	 *
	 * Two different firmware commands are needed because interface
	 * type (AP/P2P) and raw-mode overlay (TX-inject/promiscuous)
	 * live in separate firmware config paths: SET_INTERFACE vs
	 * RAW_CONFIG_MODE respectively.
	 */
	if (if_idx == 0 && vif_ctx->if_type != NRF_WIFI_IFTYPE_STATION) {
		if (vif_ctx->if_type == NRF_WIFI_IFTYPE_AP ||
		    vif_ctx->if_type == NRF_WIFI_IFTYPE_P2P_GO ||
		    vif_ctx->if_type == NRF_WIFI_IFTYPE_P2P_CLIENT) {
			struct nrf_wifi_umac_chg_vif_attr_info sta_info;

