nrfconnect/sdk-nrf/drivers/wifi/nrf71/osal/fw_if/umac_if/src/system/fmac_api.c
			nrf_wifi_mem_set(&sta_info, 0,
					     sizeof(sta_info));
			sta_info.iftype = NRF_WIFI_IFTYPE_STATION;
			reset_status = nrf_wifi_sys_fmac_chg_vif(fmac_dev_ctx, if_idx,
						  &sta_info);
		}
#ifdef NRF71_SYSTEM_WITH_RAW_MODES
		else {
			reset_status = nrf_wifi_sys_fmac_set_mode(fmac_dev_ctx, if_idx,
						   NRF_WIFI_STA_MODE);
		}
#endif /* NRF71_SYSTEM_WITH_RAW_MODES */
	}

	if (reset_status != NRF_WIFI_STATUS_SUCCESS) {
		nrf_wifi_osal_log_err("%s: Failed to reset VIF %d",
				      __func__, if_idx);
		status = reset_status;
		nrf_wifi_fmac_vif_decr_if_type(fmac_dev_ctx, vif_ctx->if_type);
		goto out;
	}

	/* Firmware manages VIF 0 internally, only send DEL_INTERFACE
	 * for non-default VIFs.
	 */
	if (if_idx != 0) {
		del_vif_cmd = nrf_wifi_mem_zalloc(NRF_WIFI_MEM_POOL_TYPE_CTRL,
						  sizeof(*del_vif_cmd));

		if (!del_vif_cmd) {
			nrf_wifi_osal_log_err("%s: Unable to allocate memory for cmd",
					      __func__);
			goto out;
		}

		del_vif_cmd->umac_hdr.cmd_evnt = NRF_WIFI_UMAC_CMD_DEL_INTERFACE;
		del_vif_cmd->umac_hdr.ids.wdev_id = if_idx;
		del_vif_cmd->umac_hdr.ids.valid_fields |= NRF_WIFI_INDEX_IDS_WDEV_ID_VALID;

		status = umac_cmd_cfg(fmac_dev_ctx,
				      del_vif_cmd,
				      sizeof(*del_vif_cmd));

		if (status != NRF_WIFI_STATUS_SUCCESS) {
			nrf_wifi_osal_log_err("%s: NRF_WIFI_UMAC_CMD_DEL_INTERFACE failed",
					      __func__);
			goto out;
		}
	} else {
		status = NRF_WIFI_STATUS_SUCCESS;
	}

	nrf_wifi_fmac_vif_decr_if_type(fmac_dev_ctx, vif_ctx->if_type);

out:
	if (del_vif_cmd) {
		nrf_wifi_mem_free(NRF_WIFI_MEM_POOL_TYPE_CTRL, del_vif_cmd);
	}

	if (vif_ctx) {
		/* Release the slot along with the context. Leaving it set would
		 * both dangle and make nrf_wifi_fmac_vif_idx_get() hand out the
		 * next index instead of reusing this one.
		 */
		sys_dev_ctx->vif_ctx[if_idx] = NULL;
		nrf_wifi_mem_free(NRF_WIFI_MEM_POOL_TYPE_CTRL, vif_ctx);
	}

	return status;
}


enum nrf_wifi_status nrf_wifi_sys_fmac_chg_vif(void *dev_ctx,
					       unsigned char if_idx,
					       struct nrf_wifi_umac_chg_vif_attr_info *vif_info)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_umac_cmd_chg_vif_attr *chg_vif_cmd = NULL;
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;

	fmac_dev_ctx = dev_ctx;

	if (fmac_dev_ctx->op_mode != NRF_WIFI_OP_MODE_SYS) {
		nrf_wifi_osal_log_err("%s: Invalid op mode",
				      __func__);
		goto out;
	}

	switch (vif_info->iftype) {
	case NRF_WIFI_IFTYPE_STATION:
	case NRF_WIFI_IFTYPE_P2P_CLIENT:
#ifdef NRF71_SYSTEM_WITH_RAW_MODES
	case NRF_WIFI_STA_TX_INJECTOR:
	case NRF_WIFI_STA_PROMISC:
	case NRF_WIFI_STA_PROMISC_TX_INJECTOR:
#endif /* NRF71_SYSTEM_WITH_RAW_MODES */
	case NRF_WIFI_IFTYPE_AP:
	case NRF_WIFI_IFTYPE_P2P_GO:
		break;
	default:
		nrf_wifi_osal_log_err("%s: VIF type %d not supported",
				      __func__, vif_info->iftype);
		goto out;
	}

	if (nrf_wifi_fmac_vif_check_if_limit(fmac_dev_ctx,
					     vif_info->iftype)) {
		goto out;
	}

	chg_vif_cmd = nrf_wifi_mem_zalloc(NRF_WIFI_MEM_POOL_TYPE_CTRL, sizeof(*chg_vif_cmd));

	if (!chg_vif_cmd) {
		nrf_wifi_osal_log_err("%s: Unable to allocate memory",
				      __func__);
		goto out;
	}

	chg_vif_cmd->umac_hdr.cmd_evnt = NRF_WIFI_UMAC_CMD_SET_INTERFACE;
	chg_vif_cmd->umac_hdr.ids.wdev_id = if_idx;
	chg_vif_cmd->umac_hdr.ids.valid_fields |= NRF_WIFI_INDEX_IDS_WDEV_ID_VALID;

	nrf_wifi_mem_cpy(&chg_vif_cmd->info,
			      vif_info,
			      sizeof(chg_vif_cmd->info));

	chg_vif_cmd->valid_fields |= NRF_WIFI_SET_INTERFACE_IFTYPE_VALID;
	chg_vif_cmd->valid_fields |= NRF_WIFI_SET_INTERFACE_USE_4ADDR_VALID;

	status = umac_cmd_cfg(fmac_dev_ctx,
			      chg_vif_cmd,
			      sizeof(*chg_vif_cmd));
out:
	if (chg_vif_cmd) {
		nrf_wifi_mem_free(NRF_WIFI_MEM_POOL_TYPE_CTRL, chg_vif_cmd);
	}

	if (status == NRF_WIFI_STATUS_SUCCESS) {
		struct nrf_wifi_sys_fmac_dev_ctx *sys_dev_ctx = NULL;

		sys_dev_ctx = wifi_dev_priv(fmac_dev_ctx);

		nrf_wifi_fmac_vif_update_if_type(fmac_dev_ctx,
						 if_idx,
						 vif_info->iftype);

		sys_dev_ctx->vif_ctx[if_idx]->if_type = vif_info->iftype;
	}

	return status;
}


#define RPU_CMD_TIMEOUT_MS 10000
enum nrf_wifi_status nrf_wifi_sys_fmac_chg_vif_state(
	void *dev_ctx,
	unsigned char if_idx,
	struct nrf_wifi_umac_chg_vif_state_info *vif_info)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_umac_cmd_chg_vif_state *chg_vif_state_cmd = NULL;
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;
	struct nrf_wifi_fmac_vif_ctx *vif_ctx = NULL;
	unsigned int count = RPU_CMD_TIMEOUT_MS;
	struct nrf_wifi_sys_fmac_dev_ctx *sys_dev_ctx = NULL;

	fmac_dev_ctx = dev_ctx;

	if (fmac_dev_ctx->op_mode != NRF_WIFI_OP_MODE_SYS) {
		nrf_wifi_osal_log_err("%s: Invalid op mode",
				      __func__);
		goto out;
	}

	sys_dev_ctx = wifi_dev_priv(fmac_dev_ctx);

	chg_vif_state_cmd = nrf_wifi_mem_zalloc(NRF_WIFI_MEM_POOL_TYPE_CTRL,
						sizeof(*chg_vif_state_cmd));

	if (!chg_vif_state_cmd) {
		nrf_wifi_osal_log_err("%s: Unable to allocate memory",
				      __func__);
		goto out;
	}

	chg_vif_state_cmd->umac_hdr.cmd_evnt = NRF_WIFI_UMAC_CMD_SET_IFFLAGS;
	chg_vif_state_cmd->umac_hdr.ids.wdev_id = if_idx;
	chg_vif_state_cmd->umac_hdr.ids.valid_fields |=
		NRF_WIFI_INDEX_IDS_WDEV_ID_VALID;

	nrf_wifi_mem_cpy(&chg_vif_state_cmd->info,
			      vif_info,
			      sizeof(chg_vif_state_cmd->info));

	vif_ctx = sys_dev_ctx->vif_ctx[if_idx];

	vif_ctx->ifflags = false;

	status = umac_cmd_cfg(fmac_dev_ctx,
			      chg_vif_state_cmd,
			      sizeof(*chg_vif_state_cmd));

	while (!vif_ctx->ifflags && (--count > 0)) {
		nrf_wifi_osal_sleep_ms(1);
	}

	if (count == 0) {
		status = NRF_WIFI_STATUS_FAIL;
		nrf_wifi_osal_log_err("%s: RPU is unresponsive for %d sec",
				      __func__, RPU_CMD_TIMEOUT_MS / 1000);
		goto out;
	}
#ifdef NRF71_AP_MODE
	if (vif_ctx->if_type == NRF_WIFI_IFTYPE_AP) {
		if (vif_info->state == 1) {
			sys_dev_ctx->tx_config.peers[MAX_PEERS].peer_id = MAX_PEERS;
			sys_dev_ctx->tx_config.peers[MAX_PEERS].if_idx = if_idx;
		} else if (vif_info->state == 0) {
			sys_dev_ctx->tx_config.peers[MAX_PEERS].peer_id = -1;
			sys_dev_ctx->tx_config.peers[MAX_PEERS].if_idx = if_idx;
		}
	}
#endif /* NRF71_AP_MODE */
out:
	if (chg_vif_state_cmd) {
		nrf_wifi_mem_free(NRF_WIFI_MEM_POOL_TYPE_CTRL, chg_vif_state_cmd);
	}

