nrfconnect/sdk-nrf/drivers/wifi/nrf71/osal/fw_if/umac_if/src/system/fmac_api.c
	return status;
}


enum nrf_wifi_status nrf_wifi_sys_fmac_get_wiphy(void *dev_ctx, unsigned char if_idx)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_cmd_get_wiphy *get_wiphy = NULL;
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;

	fmac_dev_ctx = dev_ctx;

	if (!dev_ctx || (if_idx >= MAX_NUM_VIFS)) {
		goto out;
	}

	if (fmac_dev_ctx->op_mode != NRF_WIFI_OP_MODE_SYS) {
		nrf_wifi_osal_log_err("%s: Invalid op mode",
				      __func__);
		goto out;
	}

	get_wiphy = nrf_wifi_mem_zalloc(NRF_WIFI_MEM_POOL_TYPE_CTRL, sizeof(*get_wiphy));

	if (!get_wiphy) {
		nrf_wifi_osal_log_err("%s: Unable to allocate memory",
				      __func__);
		goto out;
	}

	get_wiphy->umac_hdr.cmd_evnt = NRF_WIFI_UMAC_CMD_GET_WIPHY;
	get_wiphy->umac_hdr.ids.wdev_id = if_idx;
	get_wiphy->umac_hdr.ids.valid_fields |= NRF_WIFI_INDEX_IDS_WDEV_ID_VALID;

	status = umac_cmd_cfg(fmac_dev_ctx,
			      get_wiphy,
			      sizeof(*get_wiphy));
out:
	if (get_wiphy) {
		nrf_wifi_mem_free(NRF_WIFI_MEM_POOL_TYPE_CTRL, get_wiphy);
	}

	return status;
}

enum nrf_wifi_status nrf_wifi_sys_fmac_register_frame(
	void *dev_ctx,
	unsigned char if_idx,
	struct nrf_wifi_umac_mgmt_frame_info *frame_info)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_umac_cmd_mgmt_frame_reg *frame_reg_cmd = NULL;
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;

	fmac_dev_ctx = dev_ctx;

	if (!dev_ctx || (if_idx >= MAX_NUM_VIFS) || !frame_info) {
		goto out;
	}

	if (fmac_dev_ctx->op_mode != NRF_WIFI_OP_MODE_SYS) {
		nrf_wifi_osal_log_err("%s: Invalid op mode",
				      __func__);
		goto out;
	}

	frame_reg_cmd =
		nrf_wifi_mem_zalloc(NRF_WIFI_MEM_POOL_TYPE_CTRL, sizeof(*frame_reg_cmd));

	if (!frame_reg_cmd) {
		nrf_wifi_osal_log_err("%s: Unable to allocate memory",
				      __func__);
		goto out;
	}

	frame_reg_cmd->umac_hdr.cmd_evnt = NRF_WIFI_UMAC_CMD_REGISTER_FRAME;
	frame_reg_cmd->umac_hdr.ids.wdev_id = if_idx;
	frame_reg_cmd->umac_hdr.ids.valid_fields |= NRF_WIFI_INDEX_IDS_WDEV_ID_VALID;

	nrf_wifi_mem_cpy(&frame_reg_cmd->info, frame_info, sizeof(frame_reg_cmd->info));

	status = umac_cmd_cfg(fmac_dev_ctx, frame_reg_cmd, sizeof(*frame_reg_cmd));
out:
	if (frame_reg_cmd) {
		nrf_wifi_mem_free(NRF_WIFI_MEM_POOL_TYPE_CTRL, frame_reg_cmd);
	}

	return status;
}

enum nrf_wifi_status nrf_wifi_sys_fmac_twt_setup(void *dev_ctx,
						 unsigned char if_idx,
						 struct nrf_wifi_umac_config_twt_info *twt_params)
{

	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_umac_cmd_config_twt *twt_setup_cmd = NULL;
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;

	if (!dev_ctx || !twt_params) {
		goto out;
	}

	fmac_dev_ctx = dev_ctx;

	if (fmac_dev_ctx->op_mode != NRF_WIFI_OP_MODE_SYS) {
		nrf_wifi_osal_log_err("%s: Invalid op mode",
				      __func__);
		goto out;
	}

	twt_setup_cmd = nrf_wifi_mem_zalloc(NRF_WIFI_MEM_POOL_TYPE_CTRL, sizeof(*twt_setup_cmd));

	if (!twt_setup_cmd) {
		nrf_wifi_osal_log_err("%s: Unable to allocate memory",
				      __func__);
		goto out;
	}

	nrf_wifi_mem_cpy(&twt_setup_cmd->info,
			      twt_params,
			      sizeof(twt_setup_cmd->info));

	twt_setup_cmd->umac_hdr.cmd_evnt = NRF_WIFI_UMAC_CMD_CONFIG_TWT;
	twt_setup_cmd->umac_hdr.ids.wdev_id = if_idx;
	twt_setup_cmd->umac_hdr.ids.valid_fields |= NRF_WIFI_INDEX_IDS_WDEV_ID_VALID;

	status = umac_cmd_cfg(fmac_dev_ctx,
			      twt_setup_cmd,
			      sizeof(*twt_setup_cmd));
out:
	if (twt_setup_cmd) {
		nrf_wifi_mem_free(NRF_WIFI_MEM_POOL_TYPE_CTRL, twt_setup_cmd);
	}

	return status;
}


enum nrf_wifi_status nrf_wifi_sys_fmac_twt_teardown(
	void *dev_ctx,
	unsigned char if_idx,
	struct nrf_wifi_umac_config_twt_info *twt_params)
{

	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_umac_cmd_teardown_twt *twt_teardown_cmd = NULL;
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;

	if (!dev_ctx || !twt_params) {
		goto out;
	}

	fmac_dev_ctx = dev_ctx;

	if (fmac_dev_ctx->op_mode != NRF_WIFI_OP_MODE_SYS) {
		nrf_wifi_osal_log_err("%s: Invalid op mode",
				      __func__);
		goto out;
	}

	twt_teardown_cmd = nrf_wifi_mem_zalloc(NRF_WIFI_MEM_POOL_TYPE_CTRL,
					       sizeof(*twt_teardown_cmd));

	if (!twt_teardown_cmd) {
		nrf_wifi_osal_log_err("%s: Unable to allocate memory",
				      __func__);
		goto out;
	}

	nrf_wifi_mem_cpy(&twt_teardown_cmd->info,
			      twt_params,
			      sizeof(twt_teardown_cmd->info));

	twt_teardown_cmd->umac_hdr.cmd_evnt = NRF_WIFI_UMAC_CMD_TEARDOWN_TWT;
	twt_teardown_cmd->umac_hdr.ids.wdev_id = if_idx;
	twt_teardown_cmd->umac_hdr.ids.valid_fields |= NRF_WIFI_INDEX_IDS_WDEV_ID_VALID;

	status = umac_cmd_cfg(fmac_dev_ctx,
			      twt_teardown_cmd,
			      sizeof(*twt_teardown_cmd));
out:
	if (twt_teardown_cmd) {
		nrf_wifi_mem_free(NRF_WIFI_MEM_POOL_TYPE_CTRL, twt_teardown_cmd);
	}

	return status;
}

enum nrf_wifi_status nrf_wifi_sys_fmac_set_mcast_addr(struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx,
						      unsigned char if_idx,
						      struct nrf_wifi_umac_mcast_cfg *mcast_info)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_umac_cmd_mcast_filter *set_mcast_cmd = NULL;

	if (fmac_dev_ctx->op_mode != NRF_WIFI_OP_MODE_SYS) {
		nrf_wifi_osal_log_err("%s: Invalid op mode",
				      __func__);
		goto out;
	}

	set_mcast_cmd = nrf_wifi_mem_zalloc(NRF_WIFI_MEM_POOL_TYPE_CTRL, sizeof(*set_mcast_cmd));

	if (!set_mcast_cmd) {
		nrf_wifi_osal_log_err("%s: Unable to allocate memory",
				      __func__);
		goto out;
	}

	set_mcast_cmd->umac_hdr.cmd_evnt = NRF_WIFI_UMAC_CMD_MCAST_FILTER;
	set_mcast_cmd->umac_hdr.ids.wdev_id = if_idx;
	set_mcast_cmd->umac_hdr.ids.valid_fields |= NRF_WIFI_INDEX_IDS_WDEV_ID_VALID;

	nrf_wifi_mem_cpy(&set_mcast_cmd->info,
			      mcast_info,
			      sizeof(*mcast_info));

	status = umac_cmd_cfg(fmac_dev_ctx,
			      set_mcast_cmd,
			      sizeof(*set_mcast_cmd));
out:

	if (set_mcast_cmd) {
		nrf_wifi_mem_free(NRF_WIFI_MEM_POOL_TYPE_CTRL, set_mcast_cmd);
	}
	return status;
}


enum nrf_wifi_status nrf_wifi_sys_fmac_get_conn_info(void *dev_ctx,
						     unsigned char if_idx)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_umac_cmd_conn_info *cmd = NULL;
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;

