nrfconnect/sdk-nrf/drivers/wifi/nrf71/osal/fw_if/umac_if/src/system/fmac_api.c
	fmac_dev_ctx = dev_ctx;

	if (fmac_dev_ctx->op_mode != NRF_WIFI_OP_MODE_SYS) {
		nrf_wifi_osal_log_err("%s: Invalid op mode",
				      __func__);
		goto out;
	}

	cmd = nrf_wifi_mem_zalloc(NRF_WIFI_MEM_POOL_TYPE_CTRL, sizeof(*cmd));

	if (!cmd) {
		nrf_wifi_osal_log_err("%s: Unable to allocate memory",
				      __func__);
		goto out;
	}
	cmd->umac_hdr.cmd_evnt = NRF_WIFI_UMAC_CMD_GET_CONNECTION_INFO;
	cmd->umac_hdr.ids.wdev_id = if_idx;
	cmd->umac_hdr.ids.valid_fields |= NRF_WIFI_INDEX_IDS_WDEV_ID_VALID;

	status = umac_cmd_cfg(fmac_dev_ctx,
			      cmd,
			      sizeof(*cmd));
out:
	if (cmd) {
		nrf_wifi_mem_free(NRF_WIFI_MEM_POOL_TYPE_CTRL, cmd);
	}

	return status;
}

enum nrf_wifi_status nrf_wifi_sys_fmac_get_power_save_info(void *dev_ctx,
							   unsigned char if_idx)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_umac_cmd_get_power_save_info *get_ps_info_cmd = NULL;
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;

	fmac_dev_ctx = dev_ctx;

	if (fmac_dev_ctx->op_mode != NRF_WIFI_OP_MODE_SYS) {
		nrf_wifi_osal_log_err("%s: Invalid op mode",
				      __func__);
		goto out;
	}

	get_ps_info_cmd = nrf_wifi_mem_zalloc(NRF_WIFI_MEM_POOL_TYPE_CTRL,
					      sizeof(*get_ps_info_cmd));

	if (!get_ps_info_cmd) {
		nrf_wifi_osal_log_err("%s: Unable to allocate memory", __func__);
		goto out;
	}

	get_ps_info_cmd->umac_hdr.cmd_evnt = NRF_WIFI_UMAC_CMD_GET_POWER_SAVE_INFO;
	get_ps_info_cmd->umac_hdr.ids.wdev_id = if_idx;
	get_ps_info_cmd->umac_hdr.ids.valid_fields |=
			NRF_WIFI_INDEX_IDS_WDEV_ID_VALID;

	status = umac_cmd_cfg(fmac_dev_ctx,
			      get_ps_info_cmd,
			      sizeof(*get_ps_info_cmd));
out:
	if (get_ps_info_cmd) {
		nrf_wifi_mem_free(NRF_WIFI_MEM_POOL_TYPE_CTRL, get_ps_info_cmd);
	}

	return status;
}

enum nrf_wifi_status nrf_wifi_sys_fmac_set_listen_interval(void *dev_ctx,
							   unsigned char if_idx,
							   unsigned short listen_interval)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_umac_cmd_set_listen_interval *set_listen_interval_cmd = NULL;
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;

	fmac_dev_ctx = dev_ctx;

	if (fmac_dev_ctx->op_mode != NRF_WIFI_OP_MODE_SYS) {
		nrf_wifi_osal_log_err("%s: Invalid op mode",
				      __func__);
		goto out;
	}

	set_listen_interval_cmd = nrf_wifi_mem_zalloc(NRF_WIFI_MEM_POOL_TYPE_CTRL,
						      sizeof(*set_listen_interval_cmd));

	if (!set_listen_interval_cmd) {
		nrf_wifi_osal_log_err("%s: Unable to allocate memory", __func__);
		goto out;
	}

	set_listen_interval_cmd->umac_hdr.cmd_evnt = NRF_WIFI_UMAC_CMD_SET_LISTEN_INTERVAL;
	set_listen_interval_cmd->umac_hdr.ids.wdev_id = if_idx;
	set_listen_interval_cmd->umac_hdr.ids.valid_fields |=
		NRF_WIFI_INDEX_IDS_WDEV_ID_VALID;
	set_listen_interval_cmd->listen_interval = listen_interval;

	status = umac_cmd_cfg(fmac_dev_ctx,
			      set_listen_interval_cmd,
			      sizeof(*set_listen_interval_cmd));
out:
	if (set_listen_interval_cmd) {
		nrf_wifi_mem_free(NRF_WIFI_MEM_POOL_TYPE_CTRL, set_listen_interval_cmd);
	}

	return status;
}


enum nrf_wifi_status nrf_wifi_sys_fmac_set_ps_wakeup_mode(void *dev_ctx,
							  unsigned char if_idx,
							  bool ps_wakeup_mode)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_umac_cmd_config_extended_ps *set_ps_wakeup_mode_cmd = NULL;
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;

	fmac_dev_ctx = dev_ctx;

	if (fmac_dev_ctx->op_mode != NRF_WIFI_OP_MODE_SYS) {
		nrf_wifi_osal_log_err("%s: Invalid op mode",
				      __func__);
		goto out;
	}

	set_ps_wakeup_mode_cmd = nrf_wifi_mem_zalloc(NRF_WIFI_MEM_POOL_TYPE_CTRL,
						     sizeof(*set_ps_wakeup_mode_cmd));

	if (!set_ps_wakeup_mode_cmd) {
		nrf_wifi_osal_log_err("%s: Unable to allocate memory", __func__);
		goto out;
	}

	set_ps_wakeup_mode_cmd->umac_hdr.cmd_evnt = NRF_WIFI_UMAC_CMD_CONFIG_EXTENDED_PS;
	set_ps_wakeup_mode_cmd->umac_hdr.ids.wdev_id = if_idx;
	set_ps_wakeup_mode_cmd->umac_hdr.ids.valid_fields |=
		NRF_WIFI_INDEX_IDS_WDEV_ID_VALID;
	set_ps_wakeup_mode_cmd->enable_extended_ps = ps_wakeup_mode;

	status = umac_cmd_cfg(fmac_dev_ctx,
			      set_ps_wakeup_mode_cmd,
			      sizeof(*set_ps_wakeup_mode_cmd));
out:
	if (set_ps_wakeup_mode_cmd) {
		nrf_wifi_mem_free(NRF_WIFI_MEM_POOL_TYPE_CTRL, set_ps_wakeup_mode_cmd);
	}

	return status;
}

enum nrf_wifi_status nrf_wifi_sys_fmac_set_ps_exit_strategy(void *dev_ctx,
							    unsigned char if_idx,
							    unsigned int ps_exit_strategy)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_cmd_ps_exit_strategy *set_ps_exit_strategy_cmd = NULL;
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;

	(void)if_idx;

	fmac_dev_ctx = dev_ctx;

	if (fmac_dev_ctx->op_mode != NRF_WIFI_OP_MODE_SYS) {
		nrf_wifi_osal_log_err("%s: Invalid op mode",
				      __func__);
		goto out;
	}

	set_ps_exit_strategy_cmd = nrf_wifi_mem_zalloc(NRF_WIFI_MEM_POOL_TYPE_CTRL,
						       sizeof(*set_ps_exit_strategy_cmd));

	if (!set_ps_exit_strategy_cmd) {
		nrf_wifi_osal_log_err("%s: Unable to allocate memory", __func__);
		goto out;
	}

	set_ps_exit_strategy_cmd->umac_hdr.cmd_evnt = NRF_WIFI_UMAC_CMD_PS_EXIT_STRATEGY;
	set_ps_exit_strategy_cmd->umac_hdr.ids.wdev_id = if_idx;
	set_ps_exit_strategy_cmd->umac_hdr.ids.valid_fields |=
		NRF_WIFI_INDEX_IDS_WDEV_ID_VALID;
	set_ps_exit_strategy_cmd->ps_exit_strategy = ps_exit_strategy;

	status = umac_cmd_cfg(fmac_dev_ctx,
			      set_ps_exit_strategy_cmd,
			      sizeof(*set_ps_exit_strategy_cmd));
out:
	if (set_ps_exit_strategy_cmd) {
		nrf_wifi_mem_free(NRF_WIFI_MEM_POOL_TYPE_CTRL, set_ps_exit_strategy_cmd);
	}

	return status;
}
#endif /* NRF71_STA_MODE */

enum nrf_wifi_status nrf_wifi_sys_fmac_stats_get(struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx,
						 enum rpu_stats_type stats_type,
						 struct rpu_sys_op_stats *stats)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	unsigned char count = 0;

	if (fmac_dev_ctx->op_mode != NRF_WIFI_OP_MODE_SYS) {
		nrf_wifi_osal_log_err("%s: Invalid op mode",
				      __func__);
		goto out;
	}

	if (fmac_dev_ctx->stats_req == true) {
		nrf_wifi_osal_log_err("%s: Stats request already pending",
				      __func__);
		goto out;
	}

	fmac_dev_ctx->stats_req = true;
	fmac_dev_ctx->fw_stats = &stats->fw;

