nrfconnect/sdk-nrf/drivers/wifi/nrf71/osal/fw_if/umac_if/src/system/fmac_api.c
enum nrf_wifi_status nrf_wifi_sys_fmac_debug_stats_get(struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx,
						       enum rpu_stats_type stats_type,
						       struct nrf_wifi_rpu_debug_stats *stats)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	unsigned char count = 0;

	if (!fmac_dev_ctx || !stats) {
		nrf_wifi_osal_log_err("%s: Invalid parameters", __func__);
		goto out;
	}

	if (fmac_dev_ctx->op_mode != NRF_WIFI_OP_MODE_SYS) {
		nrf_wifi_osal_log_err("%s: Invalid op mode", __func__);
		goto out;
	}

	if (fmac_dev_ctx->debug_stats_req) {
		nrf_wifi_osal_log_err("%s: Debug stats request already pending",
				      __func__);
		goto out;
	}


	fmac_dev_ctx->debug_stats_req = true;
	fmac_dev_ctx->debug_stats = stats;

	status = umac_cmd_sys_debug_stats_get(fmac_dev_ctx, stats_type);
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		fmac_dev_ctx->debug_stats_req = false;
		goto out;
	}

	do {
		nrf_wifi_osal_sleep_ms(1);
		count++;
	} while ((fmac_dev_ctx->debug_stats_req == true) &&
		 (count < NRF_WIFI_FMAC_STATS_RECV_TIMEOUT));

	if (count == NRF_WIFI_FMAC_STATS_RECV_TIMEOUT) {
		status = NRF_WIFI_STATUS_FAIL;
		fmac_dev_ctx->debug_stats_req = false;
		nrf_wifi_osal_log_err("%s: Timed out (%d ms)", __func__,
				      NRF_WIFI_FMAC_STATS_RECV_TIMEOUT);
		goto out;
	}

	status = NRF_WIFI_STATUS_SUCCESS;
out:
	return status;
}

enum nrf_wifi_status nrf_wifi_sys_fmac_umac_int_stats_get(
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx,
	struct umac_int_stats *stats)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	unsigned char count = 0;

	if (!fmac_dev_ctx || !stats) {
		nrf_wifi_osal_log_err("%s: Invalid parameters", __func__);
		goto out;
	}

	if (fmac_dev_ctx->op_mode != NRF_WIFI_OP_MODE_SYS) {
		nrf_wifi_osal_log_err("%s: Invalid op mode", __func__);
		goto out;
	}

	if (fmac_dev_ctx->umac_int_stats_req) {
		nrf_wifi_osal_log_err("%s: UMAC int stats request already pending",
				      __func__);
		goto out;
	}

	fmac_dev_ctx->umac_int_stats_req = true;
	fmac_dev_ctx->umac_int_stats = stats;

	status = umac_cmd_sys_umac_int_stats_get(fmac_dev_ctx);
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		fmac_dev_ctx->umac_int_stats_req = false;
		goto out;
	}

	do {
		nrf_wifi_osal_sleep_ms(1);
		count++;
	} while ((fmac_dev_ctx->umac_int_stats_req == true) &&
		 (count < NRF_WIFI_FMAC_STATS_RECV_TIMEOUT));

	if (count == NRF_WIFI_FMAC_STATS_RECV_TIMEOUT) {
		status = NRF_WIFI_STATUS_FAIL;
		fmac_dev_ctx->umac_int_stats_req = false;
		nrf_wifi_osal_log_err("%s: Timed out (%d ms)", __func__,
				      NRF_WIFI_FMAC_STATS_RECV_TIMEOUT);
		goto out;
	}

	status = NRF_WIFI_STATUS_SUCCESS;
out:
	return status;
}
#endif /* NRF71_UTIL */


#ifdef NRF_WIFI_RX_BUFF_PROG_UMAC
#define MAX_BUFS_PER_CMD 32
enum nrf_wifi_status nrf_wifi_fmac_prog_rx_buf_info(void *dev_ctx,
						struct nrf_wifi_rx_buf *rx_buf,
						unsigned int rx_buf_nums)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_cmd_rx_buf_info *rx_buf_cmd = NULL;
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;
	struct nrf_wifi_fmac_dev_ctx_def *def_dev_ctx = NULL;
	struct nrf_wifi_rx_buf *rx_buf_iter = NULL;
	int i = 0, remained_buf_cnt = 0, counter = 0,  rx_buff_prog_cnt = 0;

	fmac_dev_ctx = dev_ctx;
	def_dev_ctx = wifi_dev_priv(fmac_dev_ctx);

	if (rx_buf_nums > MAX_BUFS_PER_CMD) {
		rx_buff_prog_cnt = MAX_BUFS_PER_CMD;
		remained_buf_cnt = rx_buf_nums % MAX_BUFS_PER_CMD;
		counter = rx_buf_nums / MAX_BUFS_PER_CMD;
	} else {
		rx_buff_prog_cnt = rx_buf_nums;
		counter = 1;
	}

	rx_buf_iter = rx_buf;

	for (i = 0; i < counter; i++) {
		rx_buf_cmd = nrf_wifi_mem_zalloc(NRF_WIFI_MEM_POOL_TYPE_CTRL, sizeof(*rx_buf_cmd) +
					rx_buff_prog_cnt * sizeof(struct nrf_wifi_rx_buf));
		if (!rx_buf_cmd) {
			nrf_wifi_osal_log_err("%s: Unable to allocate memory\n", __func__);
			goto out;
		}

		rx_buf_cmd->umac_hdr.cmd_evnt = NRF_WIFI_UMAC_CMD_CONFIG_RX_BUF;
		nrf_wifi_mem_cpy(&rx_buf_cmd->info,
				      rx_buf,
				      rx_buff_prog_cnt * sizeof(struct nrf_wifi_rx_buf));

		rx_buf_cmd->rx_buf_num = rx_buff_prog_cnt;

		status = umac_cmd_cfg(fmac_dev_ctx,
				      rx_buf_cmd,
				      sizeof(*rx_buf_cmd) +
				      rx_buff_prog_cnt * sizeof(struct nrf_wifi_rx_buf));
		if (rx_buf_cmd) {
			nrf_wifi_mem_free(NRF_WIFI_MEM_POOL_TYPE_CTRL, rx_buf_cmd);
		}
	}
	if (remained_buf_cnt > 0) {
		rx_buf_cmd = nrf_wifi_mem_zalloc(NRF_WIFI_MEM_POOL_TYPE_CTRL, sizeof(*rx_buf_cmd) +
					remained_buf_cnt * sizeof(struct nrf_wifi_rx_buf));
		if (!rx_buf_cmd) {
			nrf_wifi_osal_log_err("%s: Unable to allocate memory\n", __func__);
			goto out;
		}

		rx_buf_cmd->umac_hdr.cmd_evnt = NRF_WIFI_UMAC_CMD_CONFIG_RX_BUF;
		nrf_wifi_mem_cpy(&rx_buf_cmd->info,
				      rx_buf + (MAX_BUFS_PER_CMD),
				      remained_buf_cnt *
				      sizeof(struct nrf_wifi_rx_buf));

		rx_buf_cmd->rx_buf_num = remained_buf_cnt;

		status = umac_cmd_cfg(fmac_dev_ctx,
				      rx_buf_cmd,
				      sizeof(*rx_buf_cmd) +
				      remained_buf_cnt * sizeof(struct nrf_wifi_rx_buf));
		if (rx_buf_cmd) {
			nrf_wifi_mem_free(NRF_WIFI_MEM_POOL_TYPE_CTRL, rx_buf_cmd);
		}
	}
out:
	return status;
}
#endif /*NRF_WIFI_RX_BUFF_PROG_UMAC */
